app/controllers/meeting_rooms_controller.rb

  def index
    page = params[:page] || 1
    per_page = params[:per_page] || 6
    @meeting_rooms = MeetingRoom.all.paginate(page: page, per_page: per_page)
---
SELECT  "meeting_rooms".* FROM "meeting_rooms" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "meeting_rooms"