app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]
---
  def index
    page = params[:page] || 1
    per_page = params[:per_page] || 10
    @orders = current_user.orders.paginate(page: page, per_page: per_page)